{
  "Victoria Memorial": {
    "opening_hours": "10:00 AM to 5:00 PM (Closed on Mondays)",
    "entrance_fee": "INR 30 (Indian nationals), INR 500 (Foreign nationals)",
    "accessibility": "Wheelchair accessible, Restrooms for people with disabilities",
    "historical_context": "Built in memory of Queen Victoria, it is a landmark of Kolkata's architectural heritage.",
    "architecture_features": "Combines British and Mughal architecture, featuring a white marble structure with gardens and sculptures.",
    "local_culture_customs": "Hosts cultural events and exhibitions showcasing Bengal's heritage, with traditional music and dance performances.",
    "visitor_tips_recommendations": "Don't forget to explore the gardens surrounding the memorial and attend the sound and light show in the evenings.",
    "nearby_attractions": "Explore nearby attractions such as St. Paul's Cathedral, Maidan Park, and the Indian Museum.",
    "directions": "The Victoria Memorial is located in Kolkata, West Bengal. You can reach there by taxi, bus, or metro.",
    "specific_place_info": "The Victoria Memorial is a large marble building in Kolkata, West Bengal, India, which was built between 1906 and 1921. It is dedicated to the memory of Queen Victoria (1819–1901) and is now a museum and tourist destination under the Ministry of Culture."
  },
  "Charminar": {
    "opening_hours": "9:00 AM to 5:00 PM",
    "entrance_fee": "INR 100 (Foreign nationals), Free for Indian nationals",
    "accessibility": "Not wheelchair accessible",
    "historical_context": "Built in 1591 by Muhammad Quli Qutb Shah, it is a symbol of Hyderabad's heritage and history.",
    "architecture_features": "Islamic architecture with four grand arches, minarets, and a mosque.",
    "local_culture_customs": "A center for traditional bazaars, where you can buy pearls, jewelry, and traditional Hyderabadi garments.",
    "visitor_tips_recommendations": "Visit during the evening to see the monument illuminated and enjoy the bustling market around it.",
    "nearby_attractions": "Visit nearby attractions such as Mecca Masjid, Chowmahalla Palace, and Laad Bazaar.",
    "directions": "Charminar is located in the heart of Hyderabad, Telangana. You can reach there by taxi, auto-rickshaw, or bus.",
    "specific_place_info": "Charminar, meaning 'Four Minarets,' is a historic monument located in Hyderabad, India. It was built in 1591 by Sultan Muhammad Quli Qutb Shah, the fifth ruler of the Qutb Shahi dynasty."
  },
  "Hampi": {
    "opening_hours": "8:00 AM to 6:00 PM",
    "entrance_fee": "INR 40 (Indian nationals), INR 600 (Foreign nationals)",
    "accessibility": "Partially accessible, some areas may be difficult for wheelchair users",
    "historical_context": "Once the capital of the Vijayanagara Empire, Hampi is a UNESCO World Heritage Site known for its ancient ruins and temples.",
    "architecture_features": "Ruins of grand temples, palaces, and monuments showcasing the Vijayanagara architectural style.",
    "local_culture_customs": "Experience the local culture through traditional music performances and by exploring nearby villages.",
    "visitor_tips_recommendations": "Rent a bicycle to explore the vast archaeological site comfortably and carry water and snacks as it can get hot.",
    "nearby_attractions": "Visit attractions such as Virupaksha Temple, Vittala Temple, and Hampi Bazaar.",
    "directions": "Hampi is located in the northern part of Karnataka, India. The nearest railway station is Hospet, and you can reach Hampi by bus or taxi from there.",
    "specific_place_info": "Hampi, also known as Pampa-kshetra, Kishkindha-kshetra, or Bhaskara-kshetra, is a village and temple town recognized as a UNESCO World Heritage Site. It was the capital of the Vijayanagara Empire in the 14th century."
  },
  "Mysore Palace": {
    "opening_hours": "10:00 AM to 5:30 PM",
    "entrance_fee": "INR 70 (Indian nationals), INR 200 (Foreign nationals)",
    "accessibility": "Wheelchair accessible, Elevator available for upper floors",
    "historical_context": "Built in the 14th century and rebuilt multiple times, Mysore Palace is a symbol of Mysore's royal heritage.",
    "architecture_features": "Indo-Saracenic style architecture with domes, arches, and intricate artwork.",
    "local_culture_customs": "Witness the grandeur of the Dasara festival celebrated with cultural performances, processions, and lighting decorations.",
    "visitor_tips_recommendations": "Visit during the evening to witness the palace illuminated with thousands of lights.",
    "nearby_attractions": "Explore attractions such as Chamundi Hill, Brindavan Gardens, and Jaganmohan Palace.",
    "directions": "Mysore Palace is located in the heart of Mysore city in Karnataka, India. You can reach there by taxi, auto-rickshaw, or bus.",
    "specific_place_info": "Mysore Palace, also known as Amba Vilas Palace, is a historical palace and a royal residence at Mysore in Karnataka, India. It is the official residence of the Wadiyar dynasty and the seat of the Kingdom of Mysore."
  },
  "India Gate": {
    "opening_hours": "Open 24 hours",
    "entrance_fee": "Free entry",
    "accessibility": "Wheelchair accessible, Ramps available",
    "historical_context": "Built as a memorial to commemorate the Indian soldiers who died in World War I, India Gate is an iconic landmark of New Delhi.",
    "architecture_features": "Triumphal arch with names of soldiers inscribed, surrounded by green lawns and fountains.",
    "local_culture_customs": "A popular picnic spot for locals, especially during evenings and weekends.",
    "visitor_tips_recommendations": "Visit during the evening to see the monument illuminated and enjoy street food from nearby vendors.",
    "nearby_attractions": "Explore nearby attractions such as Rashtrapati Bhavan, National War Memorial, and Parliament House.",
    "directions": "India Gate is located in the heart of New Delhi, near Rajpath. You can reach there by taxi, auto-rickshaw, or metro.",
    "specific_place_info": "India Gate is a war memorial located astride the Rajpath, on the eastern edge of the 'ceremonial axis' of New Delhi, India, formerly called Kingsway."
  },
  "Taj Mahal": {
    "opening_hours": "6:00 AM to 7:00 PM (Closed on Fridays)",
    "entrance_fee": "INR 250 (Indian nationals), INR 1,300 (Foreign nationals)",
    "accessibility": "Partially accessible, wheelchair ramps available at certain points",
    "historical_context": "Built by Emperor Shah Jahan in memory of his wife Mumtaz Mahal, the Taj Mahal is a UNESCO World Heritage Site and one of the New Seven Wonders of the World.",
    "architecture_features": "Mughal architecture with white marble, intricate carvings, and a symmetrical layout.",
    "local_culture_customs": "Witness the changing colors of the marble as the sunlight shifts throughout the day and the moonlight at night.",
    "visitor_tips_recommendations": "Visit during sunrise or sunset for the best views and fewer crowds, and explore the gardens and the Yamuna River behind the monument.",
    "nearby_attractions": "Explore attractions such as Agra Fort, Mehtab Bagh, and Itmad-ud-Daula's Tomb.",
    "directions": "Taj Mahal is located in Agra, Uttar Pradesh, India. You can reach there by taxi, auto-rickshaw, or bus.",
    "specific_place_info": "The Taj Mahal, meaning 'Crown of the Palace,' is an ivory-white marble mausoleum on the right bank of the river Yamuna in the Indian city of Agra."
  },
  "Qutub Minar": {
    "opening_hours": "7:00 AM to 5:00 PM",
    "entrance_fee": "INR 40 (Indian nationals), INR 600 (Foreign nationals)",
    "accessibility": "Partially accessible, some areas may be difficult for wheelchair users",
    "historical_context": "Built in the 12th century by Qutb-ud-din Aibak, Qutub Minar is a UNESCO World Heritage Site and the tallest brick minaret in the world.",
    "architecture_features": "Afghan architecture with intricate carvings, verses from the Quran, and geometric patterns.",
    "local_culture_customs": "Witness the Iron Pillar, a metallurgical marvel that has not rusted in over a thousand years.",
    "visitor_tips_recommendations": "Climb to the top of the minaret for panoramic views of Delhi, and explore the nearby ruins of Quwwat-ul-Islam Mosque and Alai Darwaza.",
    "nearby_attractions": "Visit attractions such as Mehrauli Archaeological Park, Lotus Temple, and Humayun's Tomb.",
    "directions": "Qutub Minar is located in Mehrauli, New Delhi, India. You can reach there by taxi, auto-rickshaw, or metro.",
    "specific_place_info": "Qutub Minar, also spelled as Qutb Minar, is a minaret and victory tower located in the Qutb complex, a UNESCO World Heritage Site in Delhi, India."
  },
  "Gol Gumbaz": {
    "opening_hours": "10:00 AM to 5:30 PM",
    "entrance_fee": "INR 10 (Indian nationals), INR 300 (Foreign nationals)",
    "accessibility": "Partially accessible, some areas may be difficult for wheelchair users",
    "historical_context": "Built in the 17th century by Muhammad Adil Shah, Gol Gumbaz is the mausoleum of Sultan Bijapur and an architectural marvel.",
    "architecture_features": "Deccan Indo-Islamic architecture with the world's second-largest dome and whispering gallery.",
    "local_culture_customs": "Experience the acoustics of the whispering gallery, where even the faintest whisper echoes multiple times.",
    "visitor_tips_recommendations": "Climb to the top of the dome for panoramic views of Bijapur, and explore the adjacent Ibrahim Rauza complex.",
    "nearby_attractions": "Visit attractions such as Ibrahim Rauza, Jod Gumbad, and Malik-e-Maidan.",
    "directions": "Gol Gumbaz is located in Bijapur, Karnataka, India. You can reach there by taxi, auto-rickshaw, or bus.",
    "specific_place_info": "Gol Gumbaz is the mausoleum of Sultan Mohammed Adil Shah, Sultan of Bijapur. Construction of the tomb was started in 1626 and completed in 1656."
  },
  "Jantar Mantar": {
    "opening_hours": "9:00 AM to 5:00 PM",
    "entrance_fee": "INR 15 (Indian nationals), INR 200 (Foreign nationals)",
    "accessibility": "Partially accessible, some areas may be difficult for wheelchair users",
    "historical_context": "Built by Maharaja Jai Singh II in the 18th century, Jantar Mantar is an astronomical observatory and a UNESCO World Heritage Site.",
    "architecture_features": "Large-scale astronomical instruments used for observing celestial positions with naked eye.",
    "local_culture_customs": "Learn about ancient Indian astronomy and the significance of celestial bodies in Hindu astrology.",
    "visitor_tips_recommendations": "Visit during early morning or late afternoon for clear views of the instruments and attend the guided tours for detailed explanations.",
    "nearby_attractions": "Visit attractions such as City Palace, Hawa Mahal, and Albert Hall Museum.",
    "directions": "Jantar Mantar is located in Jaipur, Rajasthan, India. You can reach there by taxi, auto-rickshaw, or bus.",
    "specific_place_info": "Jantar Mantar is a collection of 19 architectural astronomical instruments built by the Rajput king Sawai Jai Singh II, the founder of Jaipur, Rajasthan. The monument was completed in 1734 CE."
  },
  "Nalanda University": {
    "opening_hours": "9:00 AM to 5:00 PM (Closed on Fridays)",
    "entrance_fee": "INR 15 (Indian nationals), INR 200 (Foreign nationals)",
    "accessibility": "Partially accessible, some areas may be difficult for wheelchair users",
    "historical_context": "Founded in the 5th century AD, Nalanda University was one of the earliest universities in the world and a renowned center for learning.",
    "architecture_features": "Ruins of ancient monasteries, temples, and lecture halls spread across a vast campus.",
    "local_culture_customs": "Discover the rich heritage of Buddhist learning and philosophy that flourished at Nalanda during its heyday.",
    "visitor_tips_recommendations": "Take a guided tour to learn about the history and significance of the university, and explore nearby archaeological sites.",
    "nearby_attractions": "Visit attractions such as Nalanda Archaeological Museum, Xuanzang Memorial, and Nava Nalanda Mahavihara.",
    "directions": "Nalanda University ruins are located near the town of Bihar Sharif in Bihar, India. You can reach there by taxi or bus from nearby towns.",
    "specific_place_info": "Nalanda University was a large Buddhist monastery and center of learning in ancient Magadha (modern-day Bihar), India. It was founded in the 5th century CE and remained active until the 12th century CE."
  }
}
